posts/2021-06-08-cag_note.org
#+title: cag_note
#+date: <2021-06-08 16:38>
#+filetags: c++

#+OPTIONS: ^:nil

