posts/2021-06-08-cag_note.org
* tank
** lobby
- 领取成就奖励: TankGainAchievementAwardReq(achievement_id, repeated select_params)
  - ThreadBase::Run()
  - TankLobbyWorker(JobBase)::Tick()
  - JobBase::ProcessMsg()
  - TankMPMsgParser::ParseTankGainAchievementAwardReq()
  - TankPlayer::GainAchieveAward()
  - CAGService::GetAchieveRuler()
  - TankPlayer::SendExchangeItemAck()
  - TankPlayer::SendAchievementAwardAckMsg()
  - AchieveRuler::MultiSelectAchieveAward()
  - TankPlayer::SaveDBData()
  - LobbyService::SendMsg2DB()
  - NetModule::SendNetMsg()
  
- 断开连接:
  - ThreadBase::Run()
  - NetWorker::Update()
  - NetModule::Update(), ProcessRecvMsg(), OnClose(), DelConnIP()
  - CAGService::DispatchRecvMsg(), ProcessNetStateMsg()
  - LobbyService::OnClosed()
    - MP 关闭: BroadcastLocalMsg(), ThreadManager::BroadcastMsg2AllLogicThread()
    - world/db/pa... 关闭: DelNetSid()
  
- 选择坦克:
  - msg: TankChooseTankReq
    | chosen_tank_id |
    | is_trail 试玩  |
  - Player::ChoseTank(), GetUsedTank(), UpdatePlayerSnsSignupData()

- 购买物品
  - msg: CagBuyshopItemReq
    | rack_id        |
    | item_id        |
    | purchase_count |
    | pay_type       |
  - Shop::BuyItem(), CanBuyShopItem()
  - ShopItemExist(), CanBuyOnceItem(), PurchaseLimited(), CostJJMoney/RMB(), PlayerCanAfford()
  - ExeBuyItem(), BuyItemCostGameMoney(), SendBuyItemResultMsg()

- Login
  - msg: CagPlayerLoginReqMsg
    | null_value |
  - Player::RegisterPlayer2World()

- Logout
  - msg: CagPlayerLogoutReqMsg
    | null_value |
  - Player::Logout()
  - DelayOffline(), SendLeaveLobbyMsg(), UnregisterPlayer2Mail/Season/Chat()

- Player init
  - msg: CagPlayerEnterReqMsg
    | nick    |
    | figure  |
    | user_id |
  - Player::Init()
  - PlayerBP()(赛季任务), PlayerTask(), Brisk()(活跃度), ExchangeResult()

- serialize player brisk DB data
  - msg: PlayerBriskDBData
    | daily_brisk 日玩家活跃度        |
    | period_brisk 自定义时间段活跃度 |
    Brisk
    | degree 活跃度           |
    | award_step 已领取奖励步 |
    | last_tm 上次刷新时间    |
  - Player::CheckTimerSaveDB()(120s)
  - Brisk::ToPB()(更新 Brisk msg)
  
* revise
- tkcagbase/deps/util/ini.h
  - 宏定义 Assert 中 exit() 修改为全局的 ::exit()
- tkcagbase/src/core/player_manager.cpp
  - PlayerManager::CreatePlayer(int) 中的 return false 改为 return nullptr
- boost/cstdint.hpp
  - typedef 将 boost 中的 int64_t/uint64_t 定义为 stdint.h 中的 int64_t/uint64_t
- 所有 struct tm 初始化时将 tm_isdst 设为 -1
- tank/tanklobby/src/battlepass/bp_config.cpp
  - #include <io.h> 改为 #include <sys/io.h>, 或把 /usr/include/sys 加到头文件搜索路径

* cmake
- 添加编译选项: add_compile_options(-g -O0 -std=c++17 -D_DEBUG -D__LINUX__ -Wno-enum-compare)
- 获取父目录: get_filename_component(PARENT_DIR ${PROJECT_SOURCE_DIR} DIRECTORY)
- 打印信息: message(STATUS "parent directory is: " ${PARENT_DIR})
- 指定可执行文件存放目录: set(EXECUTABLE_OUTPUT_PATH ${PARENT_DIR}/bin)
- 添加 protobuf 的头文件路径和链接库:
  - find_package(Protobuf)
  - include_directories(${Protobuf_INCLUDE_DIRS})
  - target_link_libraries(a.out ${Protobuf_LIBRARIES} pthread)
* redis
- normal value ::
  - set
  - get
  - setnx: set if no exists
  - incr
  - del

- list value ::
  - rpush: 尾部 push
  - lpush: 头部 push
  - rpop
  - lpop
  - llen: 长度
  - lrange
  - del

- set value, 值唯一 ::
  - sadd: 添加元素
  - srem: 删除元素
  - sismember: 测试元素是否存在
  - smembers: 返回所有元素
  - sunion: 合并多个 set
  - del

- sorted set(zset), value 通过 score 排序, 值唯一 ::
  - zadd key score1 member1 [score2 member2]
  - zrange [withscores]
  - del

- hash value, field 唯一 ::
  - hset key field value
  - hmset key field1 value1 [field2 value2]
  - hget
  - hgetall
  - hincrby
  - hdel
  - del
  
* ssdb
- todo
* protobuf
- 序列化(二进制信息保存到字符串): p1.SerializeToString(&str);
- 反序列化: p2.ParseFromString(str);
- SerializeToOstream(ostream *output);
- ParseFromIstream(istream *input);
- 将 pb 文本信息保存到字符串: 
  #+begin_src c++
  #include "google/protobuf/text_format.h"
  google::protobuf::TextFormat::PrintToString(p, &str);
  #+end_src
- 将 pb 文本信息写入文件:
  #+begin_src c++
  #include <fstream>
  #include "google/protobuf/io/zero_copy_stream_impl.h"
  #include "google/protobuf/text_format.h"

  std::ofstream fw;
  fw.open("./a.txt", std::ios::out | std::ios::binary);

  google::protobuf::io::OstreamOutputStream *output =
    new google::protobuf::io::OstreamOutputStream(&fw);

  google::protobuf::TextFormat::Print(p, output);

  delete output;
  fw.close();

  #+end_src
- add: 添加一个子对象的指针
- size: 返回 repeated 的 size
- mutable: 取子对象的指针

