2021-06-08-cag_note.html

<div id="outline-container-orge5f0986" class="outline-2">
<h2 id="orge5f0986"><span class="section-number-2">2</span> tank</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8aea5ac" class="outline-3">
<h3 id="org8aea5ac"><span class="section-number-3">2.1</span> lobby</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>领取成就奖励: TankGainAchievementAwardReq(achievement_id, repeated select_params)
<ul class="org-ul">
<li>ThreadBase::Run()</li>
<li>TankLobbyWorker(JobBase)::Tick()</li>
<li>JobBase::ProcessMsg()</li>
<li>TankMPMsgParser::ParseTankGainAchievementAwardReq()</li>
<li>TankPlayer::GainAchieveAward()</li>
<li>CAGService::GetAchieveRuler()</li>
<li>TankPlayer::SendExchangeItemAck()</li>
<li>TankPlayer::SendAchievementAwardAckMsg()</li>
<li>AchieveRuler::MultiSelectAchieveAward()</li>
<li>TankPlayer::SaveDBData()</li>
<li>LobbyService::SendMsg2DB()</li>
<li>NetModule::SendNetMsg()</li>
</ul></li>

<li>断开连接:
<ul class="org-ul">
<li>ThreadBase::Run()</li>
<li>NetWorker::Update()</li>
<li>NetModule::Update(), ProcessRecvMsg(), OnClose(), DelConnIP()</li>
<li>CAGService::DispatchRecvMsg(), ProcessNetStateMsg()</li>
<li>LobbyService::OnClosed()
<ul class="org-ul">
<li>MP 关闭: BroadcastLocalMsg(), ThreadManager::BroadcastMsg2AllLogicThread()</li>
<li>world/db/pa&#x2026; 关闭: DelNetSid()</li>
</ul></li>
</ul></li>

<li>选择坦克:
<ul class="org-ul">
<li><p>
msg: TankChooseTankReq
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">chosen_tank_id</td>
</tr>

<tr>
<td class="org-left">is_trail 试玩</td>
</tr>
</tbody>
</table></li>
<li>Player::ChoseTank(), GetUsedTank(), UpdatePlayerSnsSignupData()</li>
</ul></li>

<li>购买物品
<ul class="org-ul">
<li><p>
msg: CagBuyshopItemReq
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">rack_id</td>
</tr>

<tr>
<td class="org-left">item_id</td>
</tr>

<tr>
<td class="org-left">purchase_count</td>
</tr>

<tr>
<td class="org-left">pay_type</td>
</tr>
</tbody>
</table></li>
<li>Shop::BuyItem(), CanBuyShopItem()</li>
<li>ShopItemExist(), CanBuyOnceItem(), PurchaseLimited(), CostJJMoney/RMB(), PlayerCanAfford()</li>
<li>ExeBuyItem(), BuyItemCostGameMoney(), SendBuyItemResultMsg()</li>
</ul></li>

<li>Login
<ul class="org-ul">
<li><p>
msg: CagPlayerLoginReqMsg
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">null_value</td>
</tr>
</tbody>
</table></li>
<li>Player::RegisterPlayer2World()</li>
</ul></li>

<li>Logout
<ul class="org-ul">
<li><p>
msg: CagPlayerLogoutReqMsg
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">null_value</td>
</tr>
</tbody>
</table></li>
<li>Player::Logout()</li>
<li>DelayOffline(), SendLeaveLobbyMsg(), UnregisterPlayer2Mail/Season/Chat()</li>
</ul></li>

<li>Player init
<ul class="org-ul">
<li><p>
msg: CagPlayerEnterReqMsg
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">nick</td>
</tr>

<tr>
<td class="org-left">figure</td>
</tr>

<tr>
<td class="org-left">user_id</td>
</tr>
</tbody>
</table></li>
<li>Player::Init()</li>
<li>PlayerBP()(赛季任务), PlayerTask(), Brisk()(活跃度), ExchangeResult()</li>
</ul></li>

<li>serialize player brisk DB data
<ul class="org-ul">
<li><p>
msg: PlayerBriskDBData
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">daily_brisk 日玩家活跃度</td>
</tr>

<tr>
<td class="org-left">period_brisk 自定义时间段活跃度</td>
</tr>
</tbody>
</table>
<p>
Brisk
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">degree 活跃度</td>
</tr>

<tr>
<td class="org-left">award_step 已领取奖励步</td>
</tr>

<tr>
<td class="org-left">last_tm 上次刷新时间</td>
</tr>
</tbody>
</table></li>
<li>Player::CheckTimerSaveDB()(120s)</li>
<li>Brisk::ToPB()(更新 Brisk msg)</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org73235b2" class="outline-2">
<h2 id="org73235b2"><span class="section-number-2">3</span> revise</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>tkcagbase/deps/util/ini.h
<ul class="org-ul">
<li>宏定义 Assert 中 exit() 修改为全局的 ::exit()</li>
</ul></li>
<li>tkcagbase/src/core/player_manager.cpp
<ul class="org-ul">
<li>PlayerManager::CreatePlayer(int) 中的 return false 改为 return nullptr</li>
</ul></li>
<li>boost/cstdint.hpp
<ul class="org-ul">
<li>typedef 将 boost 中的 int64_t/uint64_t 定义为 stdint.h 中的 int64_t/uint64_t</li>
</ul></li>
<li>所有 struct tm 初始化时将 tm_isdst 设为 -1</li>
<li>tank/tanklobby/src/battlepass/bp_config.cpp
<ul class="org-ul">
<li>#include &lt;io.h&gt; 改为 #include &lt;sys/io.h&gt;, 或把 /usr/include/sys 加到头文件搜索路径</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org762edca" class="outline-2">
<h2 id="org762edca"><span class="section-number-2">4</span> cmake</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>添加编译选项: add_compile_options(-g -O0 -std=c++17 -D_DEBUG -D__LINUX__ -Wno-enum-compare)</li>
<li>获取父目录: get_filename_component(PARENT_DIR ${PROJECT_SOURCE_DIR} DIRECTORY)</li>
<li>打印信息: message(STATUS "parent directory is: " ${PARENT_DIR})</li>
<li>指定可执行文件存放目录: set(EXECUTABLE_OUTPUT_PATH ${PARENT_DIR}/bin)</li>
<li>添加 protobuf 的头文件路径和链接库:
<ul class="org-ul">
<li>find_package(Protobuf)</li>
<li>include_directories(${Protobuf_INCLUDE_DIRS})</li>
<li>target_link_libraries(a.out ${Protobuf_LIBRARIES} pthread)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgab9c25e" class="outline-2">
<h2 id="orgab9c25e"><span class="section-number-2">5</span> redis</h2>
<div class="outline-text-2" id="text-5">
<dl class="org-dl">
<dt>normal value</dt><dd><ul class="org-ul">
<li>set</li>
<li>get</li>
<li>setnx: set if no exists</li>
<li>incr</li>
<li>del</li>
</ul></dd>

<dt>list value</dt><dd><ul class="org-ul">
<li>rpush: 尾部 push</li>
<li>lpush: 头部 push</li>
<li>rpop</li>
<li>lpop</li>
<li>llen: 长度</li>
<li>lrange</li>
<li>del</li>
</ul></dd>

<dt>set value, 值唯一</dt><dd><ul class="org-ul">
<li>sadd: 添加元素</li>
<li>srem: 删除元素</li>
<li>sismember: 测试元素是否存在</li>
<li>smembers: 返回所有元素</li>
<li>sunion: 合并多个 set</li>
<li>del</li>
</ul></dd>

<dt>sorted set(zset), value 通过 score 排序, 值唯一</dt><dd><ul class="org-ul">
<li>zadd key score1 member1 [score2 member2]</li>
<li>zrange [withscores]</li>
<li>del</li>
</ul></dd>

<dt>hash value, field 唯一</dt><dd><ul class="org-ul">
<li>hset key field value</li>
<li>hmset key field1 value1 [field2 value2]</li>
<li>hget</li>
<li>hgetall</li>
<li>hincrby</li>
<li>hdel</li>
<li>del</li>
</ul></dd>
</dl>
</div>
</div>

<div id="outline-container-orgef6c9f8" class="outline-2">
<h2 id="orgef6c9f8"><span class="section-number-2">6</span> ssdb</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>todo</li>
</ul>
</div>
</div>
<div id="outline-container-orgbb11dd7" class="outline-2">
<h2 id="orgbb11dd7"><span class="section-number-2">7</span> protobuf</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>序列化(二进制信息保存到字符串): p1.SerializeToString(&amp;str);</li>
<li>反序列化: p2.ParseFromString(str);</li>
<li>SerializeToOstream(ostream *output);</li>
<li>ParseFromIstream(istream *input);</li>
<li><p>
将 pb 文本信息保存到字符串: 
</p>
<div class="org-src-container">
<pre class="src src-c++">#include "google/protobuf/text_format.h"
google::protobuf::TextFormat::PrintToString(p, &amp;str);
</pre>
</div></li>
<li><p>
将 pb 文本信息写入文件:
</p>
<div class="org-src-container">
<pre class="src src-c++">#include &lt;fstream&gt;
#include "google/protobuf/io/zero_copy_stream_impl.h"
#include "google/protobuf/text_format.h"

std::ofstream fw;
fw.open("./a.txt", std::ios::out | std::ios::binary);

google::protobuf::io::OstreamOutputStream *output =
  new google::protobuf::io::OstreamOutputStream(&amp;fw);

google::protobuf::TextFormat::Print(p, output);

delete output;
fw.close();

</pre>
</div></li>
<li>add: 添加一个子对象的指针</li>
<li>size: 返回 repeated 的 size</li>
<li>mutable: 取子对象的指针</li>
</ul>
</div>
</div>
<div class="taglist"><a href="https://zhongming-unice.github.io/tags.html">Tags</a>: <a href="https://zhongming-unice.github.io/tag-c++.html">c++</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
